JayHeng/RT-VRA/boards/mcu/vra_fw/imxrt595/port_mixspi_info.h
            case CLKCTL0_FLEXSPI0FCLKSEL_SEL(2):
               {
                   uint32_t Aux0PllClkFreq = CLOCK_GetSysPfdFreq(kCLOCK_Pfd2) / ((CLKCTL0->AUX0PLLCLKDIV & CLKCTL0_AUX0PLLCLKDIV_DIV_MASK) + 1U);
                   vra_printf("VRA: FLEXSPI0 Clk Source from 3'b010 - SYSPLL0 AUX0 PLL Clock %dHz.\r\n", Aux0PllClkFreq);
                   break;
               }

            case CLKCTL0_FLEXSPI0FCLKSEL_SEL(3):
                vra_printf("VRA: FLEXSPI0 Clk Source from 3'b011 - FRO_DIV1 Clock %dHz.\r\n", CLK_FRO_CLK);
                break;

            case CLKCTL0_FLEXSPI0FCLKSEL_SEL(4):
               {
                   uint32_t Aux1PllClkFreq = CLOCK_GetSysPfdFreq(kCLOCK_Pfd3) / ((CLKCTL0->AUX1PLLCLKDIV & CLKCTL0_AUX1PLLCLKDIV_DIV_MASK) + 1U);
                   vra_printf("VRA: FLEXSPI0 Clk Source from 3'b100 - SYSPLL0 AUX1 PLL Clock %dHz.\r\n", Aux1PllClkFreq);
                   break;
               }

            default:
                break;
        }
    }
    else if (base == FLEXSPI1)
    {
        index = 1;
        clkSel = CLKCTL0->FLEXSPI1FCLKSEL & CLKCTL0_FLEXSPI1FCLKSEL_SEL_MASK;
        clkDiv = CLKCTL0->FLEXSPI1FCLKDIV & CLKCTL0_FLEXSPI1FCLKDIV_DIV_MASK;
        switch (clkSel)
        {
            case CLKCTL0_FLEXSPI1FCLKSEL_SEL(0):
                vra_printf("VRA: FLEXSPI1 Clk Source from 3'b000 - Main Clock %dHz.\r\n", CLOCK_GetMainClkFreq());
                break;

            case CLKCTL0_FLEXSPI1FCLKSEL_SEL(1):
               {
                   uint32_t MainPllClkFreq = CLOCK_GetSysPfdFreq(kCLOCK_Pfd0) / ((CLKCTL0->MAINPLLCLKDIV & CLKCTL0_MAINPLLCLKDIV_DIV_MASK) + 1U);
                   vra_printf("VRA: FLEXSPI1 Clk Source from 3'b001 - Main System PLL Clock %dHz.\r\n", MainPllClkFreq);
                   break;
               }

            case CLKCTL0_FLEXSPI1FCLKSEL_SEL(2):
               {
                   uint32_t Aux0PllClkFreq = CLOCK_GetSysPfdFreq(kCLOCK_Pfd2) / ((CLKCTL0->AUX0PLLCLKDIV & CLKCTL0_AUX0PLLCLKDIV_DIV_MASK) + 1U);
                   vra_printf("VRA: FLEXSPI1 Clk Source from 3'b010 - SYSPLL0 AUX0 PLL Clock %dHz.\r\n", Aux0PllClkFreq);
                   break;
               }

            case CLKCTL0_FLEXSPI1FCLKSEL_SEL(3):
                vra_printf("VRA: FLEXSPI1 Clk Source from 3'b011 - FRO_DIV1 Clock %dHz.\r\n", CLK_FRO_CLK);
                break;

            case CLKCTL0_FLEXSPI1FCLKSEL_SEL(4):
               {
                   uint32_t Aux1PllClkFreq = CLOCK_GetSysPfdFreq(kCLOCK_Pfd3) / ((CLKCTL0->AUX1PLLCLKDIV & CLKCTL0_AUX1PLLCLKDIV_DIV_MASK) + 1U);
                   vra_printf("VRA: FLEXSPI1 Clk Source from 3'b100 - SYSPLL0 AUX1 PLL Clock %dHz.\r\n", Aux1PllClkFreq);
                   break;
               }

            default:
                break;
        }
    }
    else
    {}
    vra_printf("VRA: FLEXSPI%d Clk Source Divider: %d.\r\n", index, (clkDiv + 1U));
    vra_printf("VRA: FLEXSPI%d Clk Frequency: %dHz.\r\n", index, mixspi_get_clock(EXAMPLE_MIXSPI));
#endif
}

#endif /* _PORT_MIXSPI_INFO_H_ */
